# Homework

### Problem 1
In this question, we will use the csv file **Temp.csv**. 
- Read it into a data frame, call it `Temp`. (Import the packages you think you need).

In [5]:
#### Your code here
import numpy as np
import pandas as pd

Temp = pd.read_csv('Temp.csv')
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

- We learned that the temperature at New Haven, Connecticut is currently 58 degree fahrenheit. Add this information into the DataFrame.

In [12]:
#### Your code here

new_data = pd.DataFrame({'City': ['New Haven'],'State': ['Connecticut'],'Temperature': [58]})
new_data
Temp = pd.concat([Temp, new_data], axis = 0, ignore_index=True)
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68
7   New Haven  Connecticut           58

- Replace the names of the states by their abbreviations. That is 
    - Connecticut --> CT
    - New Jersey  --> NJ
    - New York    --> NY

In [13]:
#### Your code here

Temp.replace('Connecticut', 'CT', inplace = True)
Temp.replace('New Jersey', 'NJ', inplace = True)
Temp.replace('New York', 'NY', inplace = True)
Temp

         City State  Temperature
0         NYC    NY           67
1      Albany    NY           49
2     Buffalo    NY           38
3    Hartford    CT           63
4  Bridgeport    CT           58
5      Treton    NJ           72
6      Newark    NJ           68
7   New Haven    CT           58

- Select the rows in New York.

In [18]:
#### Your code here

Temp[Temp['State']=='NY']

      City State  Temperature
0      NYC    NY           67
1   Albany    NY           49
2  Buffalo    NY           38

- What is the average of the temperature of cities in NY?

In [19]:
#### Your code here

a=Temp[Temp['State']=='NY']
a.loc[:,'Temperature'].mean()

51.333333333333336

- Find the mean and the standard deviation of the temperature of each state.

In [20]:
#### Your code here

group = Temp.groupby('State')
colFun = {'Temperature': ['mean','std']}
group.agg(colFun)

      Temperature
             mean        std
State
CT      59.666667   2.886751
NJ      70.000000   2.828427
NY      51.333333  14.640128

- We know the capital of each state: 
    - Connecticut --> Hartford
    - New Jersey  --> Treton
    - New York    --> Albany
    
    Create a data frame, `Capital`, with two columns: State and Capital, which should look like:
    
|| State| Capital|
| :-: |:---: | :---:|
| 0| CT  | Hartford|
| 1| NJ | Treton|
| 2| NY| Albany|

In [21]:
#### Your code here

Capital = pd.DataFrame({'State':['CT','NJ','NY'], 'Capital':['Hartford','Treton','Albany']} )
Capital

    Capital State
0  Hartford    CT
1    Treton    NJ
2    Albany    NY

- Mutate a new boolean column, `Capital`, to `Temp`, which is `True` if the city in the row is the capital of the state, else `False`.

In [22]:
#### Your code here

Temp = pd.merge(Temp, Capital, how='inner', on ='State')
Temp['is_Capital'] = (Temp['City'] == Temp['Capital'])
Temp

         City State  Temperature   Capital is_Capital
0         NYC    NY           67    Albany      False
1      Albany    NY           49    Albany       True
2     Buffalo    NY           38    Albany      False
3    Hartford    CT           63  Hartford       True
4  Bridgeport    CT           58  Hartford      False
5   New Haven    CT           58  Hartford      False
6      Treton    NJ           72    Treton       True
7      Newark    NJ           68    Treton      False

### Problem 2

- a. Load the Gross Domestic Product data for the 190 ranked countries in the file **GDP.csv**. Load **Country.csv** into a DataFrame. 
- b. Match the data based on the country shortcode. How many of the IDs match? 
- c. Sort the data frame in descending order by GDP rank. What is the 13th country in the resulting data frame? (Note: GDP formats as 123,456,789.)
- d. What is the average GDP for the "High income: OECD" and "High income: nonOECD" group?
- e. What is the average GDP for different income groups and regions?

In [2]:
#### Your code here
# (a)
import numpy as np
import pandas as pd
gdp = pd.read_csv('GDP.csv', skiprows=range(5), header= None, usecols=[0,1,3,4], nrows=190)
gdp.columns = ['CountryCode', 'Rank', 'CountryName', 'GDP']

In [50]:
gdp.head(5)

  CountryCode  Rank    CountryName           GDP
0         USA     1  United States   16,244,600
1         CHN     2          China    8,227,103
2         JPN     3          Japan    5,959,718
3         DEU     4        Germany    3,428,131
4         FRA     5         France    2,612,878

In [3]:
country = pd.read_csv('Country.csv')
#print country.columns.tolist()
print len(country)

234

In [4]:
# (b)
gdp2 = pd.merge(gdp, country, how='inner', on ='CountryCode')
len(gdp2)

189

In [5]:
# (c)
a = gdp.sort_values('Rank', ascending=True)
print a
print a['CountryName'][12]

    CountryCode  Rank                     CountryName           GDP
0           USA     1                   United States   16,244,600
1           CHN     2                           China    8,227,103
2           JPN     3                           Japan    5,959,718
3           DEU     4                         Germany    3,428,131
4           FRA     5                          France    2,612,878
5           GBR     6                  United Kingdom    2,471,784
6           BRA     7                          Brazil    2,252,664
7           RUS     8              Russian Federation    2,014,775
8           ITA     9                           Italy    2,014,670
9           IND    10                           India    1,841,710
10          CAN    11                          Canada    1,821,424
11          AUS    12                       Australia    1,532,408
12          ESP    13                           Spain    1,322,965
13          MEX    14                          Mexico    1,178,126
14          KOR    15                     Korea, Rep.    1,129,598
15          IDN    16                       Indonesia      878,043
16          TUR    17                          Turkey      789,257
17          NLD    18                     Netherlands      770,555
18          SAU    19                    Saudi Arabia      711,050
19          CHE    20                     Switzerland      631,173
20          SWE    21                          Sweden      523,806
21          IRN    22              Iran, Islamic Rep.      514,060
22          NOR    23                          Norway      499,667
23          POL    24                          Poland      489,795
24          BEL    25                         Belgium      483,262
25          ARG    26                       Argentina      475,502
26          AUT    27                         Austria      394,708
27          ZAF    28                    South Africa      384,313
28          VEN    29                   Venezuela, RB      381,286
29          COL    30                        Colombia      369,606
..          ...   ...                             ...           ...
160         ABW   161                           Aruba        2,584
161         BDI   162                         Burundi        2,472
162         LSO   163                         Lesotho        2,448
163         MDV   164                        Maldives        2,222
164         CAF   165        Central African Republic        2,184
165         CPV   166                      Cape Verde        1,827
166         BTN   167                          Bhutan        1,780
167         LBR   168                         Liberia        1,734
168         BLZ   169                          Belize        1,493
169         TMP   170                     Timor-Leste        1,293
170         LCA   171                       St. Lucia        1,239
171         ATG   172             Antigua and Barbuda        1,134
172         SYC   173                      Seychelles        1,129
173         SLB   174                 Solomon Islands        1,008
174         GMB   175                     Gambia, The          917
175         GNB   176                   Guinea-Bissau          822
176         VUT   177                         Vanuatu          787
178         KNA   178             St. Kitts and Nevis          767
177         GRD   178                         Grenada          767
179         VCT   180  St. Vincent and the Grenadines          713
180         WSM   181                           Samoa          684
181         COM   182                         Comoros          596
182         DMA   183                        Dominica          480
183         TON   184                           Tonga          472
184         FSM   185           Micronesia, Fed. Sts.          326
185         STP   186           S�o Tom� and Principe          263
186         PLW   187                           Palau          228
187         MHL   188                Marshall Islands          182
188         KIR   189                        Kiribati          175
189         TUV   190                          Tuvalu           40

[190 rows x 4 columns]
Spain

In [61]:
# (d)
gdp2.dtypes
# GDP is not numeric and before being able to calculate mean, we need to convert it to numeric

gdp2['GDP'] = gdp2['GDP'].str.replace(',', '')
gdp2['GDP'] = gdp2['GDP'].astype(int)

In [74]:
group = gdp2.groupby('Income Group')
colFun = {'GDP': ['mean']}
group.agg(colFun)

                               GDP
                              mean
Income Group
High income: OECD     1.483917e+06
High income: nonOECD  1.043498e+05
Low income            1.441078e+04
Lower middle income   2.566635e+05
Upper middle income   2.318478e+05

In [76]:
# (e)
group2 = gdp2.groupby(['Income Group','Region'])
colFun = {'GDP': ['mean']}
group2.agg(colFun)

#group2 = Country.groupby(['continent', 'currency','country'])

                                                          GDP
                                                         mean
Income Group         Region
High income: OECD    East Asia & Pacific         2.197268e+06
                     Europe & Central Asia       7.567044e+05
                     Middle East & North Africa  2.582170e+05
                     North America               9.033012e+06
High income: nonOECD East Asia & Pacific         1.496240e+05
                     Europe & Central Asia       2.776660e+04
                     Latin America & Caribbean   2.795480e+04
                     Middle East & North Africa  2.142531e+05
                     North America               5.474000e+03
                     Sub-Saharan Africa          1.769700e+04
Low income           East Asia & Pacific         8.154667e+03
                     Europe & Central Asia       6.723500e+03
                     Latin America & Caribbean   7.843000e+03
                     South Asia                  5.193833e+04
                     Sub-Saharan Africa          1.184393e+04
Lower middle income  East Asia & Pacific         6.604665e+05
                     Europe & Central Asia       4.314029e+04
                     Latin America & Caribbean   2.710667e+04
                     Middle East & North Africa  1.078699e+05
                     South Asia                  4.260556e+05
                     Sub-Saharan Africa          4.741100e+04
Upper middle income  East Asia & Pacific         1.030563e+05
                     Europe & Central Asia       2.696185e+05
                     Latin America & Caribbean   2.707134e+05
                     Middle East & North Africa  2.542647e+05
                     Sub-Saharan Africa          7.364683e+04